# Pandas

Pandas is the one of the most powerful and important library in the python programming language. It is built on top of Numpy and provides datastructure and data analysis tools for python programming language.

## Why Pandas

- Simple to use
- Integrated with many other data science & ML python tools 
- Helps you get your data ready for machine learning.
- Manipulate our data as the way we needed.

In [1]:
import pandas as pd

### Data Structures

In [2]:
# Series - 1D arrays is known as series 
# It take python list as input
s1 = pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [3]:
# DataFrame - 2D matrices or table is known as Dataframe. DataFrame are far more common than series
# It takes python Dictionary as input
car_make = ['Honda', 'Tesla', 'Nisaan']
car_colour = ['Red', 'Blue', 'Green']
df = pd.DataFrame({"Car make": car_make, "Colour" : car_colour})
df

  Car make Colour
0    Honda    Red
1    Tesla   Blue
2   Nisaan  Green

## Importing a CSV file

In [4]:
# CSV stands for comma seperated values. It is the common way of data storage and pandas works so good with CSVs
car_sales = pd.read_csv('car-sales.csv')
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Anatomy Of a DataFrame
<img src="pandas-anatomy-of-a-dataframe.png" />

## Exporting a dataframe

In [5]:
car_sales.to_csv("new_car_sales.csv") # this will save the dataframe to your disk in the CSV format

## Describing Data with Pandas

In [6]:
car_sales = pd.read_csv('car-sales.csv')
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [7]:
car_sales.describe()   # describe method gives some stasticals operations on the dataframe

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [8]:
car_sales.columns    # gives the names of all coloums

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [9]:
car_sales.index      # gives the index of the dataframe rows

RangeIndex(start=0, stop=10, step=1)

In [10]:
car_sales.dtypes     # Return the data type of all the columns

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [11]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [12]:
car_sales.mean()   # gives the mean of all numerical columns

C:\Users\LENOVO\AppData\Local\Temp/ipykernel_18904/1809730092.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_sales.mean()   # gives the mean of all numerical columns

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [13]:
car_sales.sum()     # add the numeric column and concat the object or strings

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

## Selecting Columns and Rows in DataFrame

In [14]:
car_sales["Doors"]

0    4
1    4
2    3
3    5
4    4
5    4
6    4
7    4
8    4
9    4
Name: Doors, dtype: int64

In [15]:
car_sales["Price"]

0     $4,000.00
1     $5,000.00
2     $7,000.00
3    $22,000.00
4     $3,500.00
5     $4,500.00
6     $7,500.00
7     $7,000.00
8     $6,250.00
9     $9,700.00
Name: Price, dtype: object

In [16]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [17]:
car_sales['Doors'].sum()

40

In [18]:
len(car_sales)       # basically gives the number of rows in Dataframe

10

In [19]:
car_sales.count()    # give the count of non-NA values

Make             10
Colour           10
Odometer (KM)    10
Doors            10
Price            10
dtype: int64

In [20]:
car_sales.head()      # check first five rows

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [21]:
car_sales.tail()     # check from bottom

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [22]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [23]:
animals = pd.Series(['cat','panda','dog','snake', 'lion'], index=[0,3,9,8,3])

In [24]:
animals

0      cat
3    panda
9      dog
8    snake
3     lion
dtype: object

In [25]:
animals.loc[3]         # loc refers to the index number

3    panda
3     lion
dtype: object

In [26]:
animals.loc[9]

'dog'

In [27]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [28]:
animals

0      cat
3    panda
9      dog
8    snake
3     lion
dtype: object

In [29]:
animals.iloc[3]       # iloc refers to position whereas loc refers to index

'snake'

In [30]:
car_sales.iloc[3]    # position 3 is same as index 3

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [31]:
# Sliceing in Dataframe
animals.iloc[:3]

0      cat
3    panda
9      dog
dtype: object

In [32]:
animals.iloc[::2]

0     cat
9     dog
3    lion
dtype: object

In [33]:
car_sales.loc[:3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00

In [34]:
car_sales.iloc[::3]

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
3     BMW  Black          11179      5  $22,000.00
6   Honda   Blue          45698      4   $7,500.00
9  Nissan  White          31600      4   $9,700.00

In [35]:
# selecting with appling filter
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [36]:
car_sales[car_sales["Odometer (KM)"] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [37]:
pd.crosstab(car_sales["Make"], car_sales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [38]:
car_sales.groupby(["Make"]).mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

  ## Manipulate Data

In [39]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [40]:
car_sales["Make"].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

In [41]:
car_sales["Make"].str.islower()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: Make, dtype: bool

In [42]:
car_sales_missing = pd.read_csv("car-sales-missing-data.csv")

In [43]:
car_sales_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [44]:
# NaN refers to missing values 
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean(), inplace=True)

In [45]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [46]:
car_sales_missing.dropna(inplace=True)

In [47]:
car_sales_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

In [48]:
car_sales_missing.to_csv("car_sales_missing_dropped.csv")

## Creating pandas data from existing data

In [49]:
# column from series 
seat_column = pd.Series([5,5,5,5,5])
car_sales["Seats"] = seat_column

In [50]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Seats
0  Toyota  White         150043      4   $4,000.00    5.0
1   Honda    Red          87899      4   $5,000.00    5.0
2  Toyota   Blue          32549      3   $7,000.00    5.0
3     BMW  Black          11179      5  $22,000.00    5.0
4  Nissan  White         213095      4   $3,500.00    5.0
5  Toyota  Green          99213      4   $4,500.00    NaN
6   Honda   Blue          45698      4   $7,500.00    NaN
7   Honda   Blue          54738      4   $7,000.00    NaN
8  Toyota  White          60000      4   $6,250.00    NaN
9  Nissan  White          31600      4   $9,700.00    NaN

In [51]:
car_sales["Seats"].fillna(6, inplace=True)

In [52]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Seats
0  Toyota  White         150043      4   $4,000.00    5.0
1   Honda    Red          87899      4   $5,000.00    5.0
2  Toyota   Blue          32549      3   $7,000.00    5.0
3     BMW  Black          11179      5  $22,000.00    5.0
4  Nissan  White         213095      4   $3,500.00    5.0
5  Toyota  Green          99213      4   $4,500.00    6.0
6   Honda   Blue          45698      4   $7,500.00    6.0
7   Honda   Blue          54738      4   $7,000.00    6.0
8  Toyota  White          60000      4   $6,250.00    6.0
9  Nissan  White          31600      4   $9,700.00    6.0

In [53]:
# Column from puthon list
fuel_economy = [7.5,9.2,5.0,9.6,8.7,5.6,9.7,5.9,7.8,10]
car_sales["Fule per 100KM"] = fuel_economy

In [54]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Seats  Fule per 100KM
0  Toyota  White         150043      4   $4,000.00    5.0             7.5
1   Honda    Red          87899      4   $5,000.00    5.0             9.2
2  Toyota   Blue          32549      3   $7,000.00    5.0             5.0
3     BMW  Black          11179      5  $22,000.00    5.0             9.6
4  Nissan  White         213095      4   $3,500.00    5.0             8.7
5  Toyota  Green          99213      4   $4,500.00    6.0             5.6
6   Honda   Blue          45698      4   $7,500.00    6.0             9.7
7   Honda   Blue          54738      4   $7,000.00    6.0             5.9
8  Toyota  White          60000      4   $6,250.00    6.0             7.8
9  Nissan  White          31600      4   $9,700.00    6.0            10.0

In [55]:
#create a column from a single value
car_sales["Number of values"] = 4

In [56]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fule per 100KM,Number of values
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,4
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,4
2,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,4
3,BMW,Black,11179,5,"$22,000.00",5.0,9.6,4
4,Nissan,White,213095,4,"$3,500.00",5.0,8.7,4
5,Toyota,Green,99213,4,"$4,500.00",6.0,5.6,4
6,Honda,Blue,45698,4,"$7,500.00",6.0,9.7,4
7,Honda,Blue,54738,4,"$7,000.00",6.0,5.9,4
8,Toyota,White,60000,4,"$6,250.00",6.0,7.8,4
9,Nissan,White,31600,4,"$9,700.00",6.0,10.0,4

In [57]:
car_sales["Passed road safety"] = True

In [58]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fule per 100KM,Number of values,Passed road safety
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,4,True
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,4,True
2,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,4,True
3,BMW,Black,11179,5,"$22,000.00",5.0,9.6,4,True
4,Nissan,White,213095,4,"$3,500.00",5.0,8.7,4,True
5,Toyota,Green,99213,4,"$4,500.00",6.0,5.6,4,True
6,Honda,Blue,45698,4,"$7,500.00",6.0,9.7,4,True
7,Honda,Blue,54738,4,"$7,000.00",6.0,5.9,4,True
8,Toyota,White,60000,4,"$6,250.00",6.0,7.8,4,True
9,Nissan,White,31600,4,"$9,700.00",6.0,10.0,4,True

In [59]:
car_sales.dtypes

Make                   object
Colour                 object
Odometer (KM)           int64
Doors                   int64
Price                  object
Seats                 float64
Fule per 100KM        float64
Number of values        int64
Passed road safety       bool
dtype: object

In [60]:
car_sales.drop("Passed road safety", axis=1)   # delete column or row based on axis

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fule per 100KM,Number of values
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,4
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,4
2,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,4
3,BMW,Black,11179,5,"$22,000.00",5.0,9.6,4
4,Nissan,White,213095,4,"$3,500.00",5.0,8.7,4
5,Toyota,Green,99213,4,"$4,500.00",6.0,5.6,4
6,Honda,Blue,45698,4,"$7,500.00",6.0,9.7,4
7,Honda,Blue,54738,4,"$7,000.00",6.0,5.9,4
8,Toyota,White,60000,4,"$6,250.00",6.0,7.8,4
9,Nissan,White,31600,4,"$9,700.00",6.0,10.0,4

In [61]:
# shuffle rows in DF 
car_sales.sample(frac=0.5)

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fule per 100KM,Number of values,Passed road safety
5,Toyota,Green,99213,4,"$4,500.00",6.0,5.6,4,True
9,Nissan,White,31600,4,"$9,700.00",6.0,10.0,4,True
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,4,True
3,BMW,Black,11179,5,"$22,000.00",5.0,9.6,4,True
2,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,4,True

In [62]:
car_sales = car_sales.sample(frac = 1)

In [63]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fule per 100KM,Number of values,Passed road safety
2,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,4,True
0,Toyota,White,150043,4,"$4,000.00",5.0,7.5,4,True
4,Nissan,White,213095,4,"$3,500.00",5.0,8.7,4,True
7,Honda,Blue,54738,4,"$7,000.00",6.0,5.9,4,True
6,Honda,Blue,45698,4,"$7,500.00",6.0,9.7,4,True
8,Toyota,White,60000,4,"$6,250.00",6.0,7.8,4,True
5,Toyota,Green,99213,4,"$4,500.00",6.0,5.6,4,True
3,BMW,Black,11179,5,"$22,000.00",5.0,9.6,4,True
1,Honda,Red,87899,4,"$5,000.00",5.0,9.2,4,True
9,Nissan,White,31600,4,"$9,700.00",6.0,10.0,4,True

In [64]:
car_sales.reset_index(drop = True, inplace=True)

In [65]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fule per 100KM,Number of values,Passed road safety
0,Toyota,Blue,32549,3,"$7,000.00",5.0,5.0,4,True
1,Toyota,White,150043,4,"$4,000.00",5.0,7.5,4,True
2,Nissan,White,213095,4,"$3,500.00",5.0,8.7,4,True
3,Honda,Blue,54738,4,"$7,000.00",6.0,5.9,4,True
4,Honda,Blue,45698,4,"$7,500.00",6.0,9.7,4,True
5,Toyota,White,60000,4,"$6,250.00",6.0,7.8,4,True
6,Toyota,Green,99213,4,"$4,500.00",6.0,5.6,4,True
7,BMW,Black,11179,5,"$22,000.00",5.0,9.6,4,True
8,Honda,Red,87899,4,"$5,000.00",5.0,9.2,4,True
9,Nissan,White,31600,4,"$9,700.00",6.0,10.0,4,True

In [66]:
 car_sales["Odometer (KM)"] = car_sales["Odometer (KM)"].apply(lambda x: x/1.6)

In [67]:
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fule per 100KM,Number of values,Passed road safety
0,Toyota,Blue,20343.125,3,"$7,000.00",5.0,5.0,4,True
1,Toyota,White,93776.875,4,"$4,000.00",5.0,7.5,4,True
2,Nissan,White,133184.375,4,"$3,500.00",5.0,8.7,4,True
3,Honda,Blue,34211.250,4,"$7,000.00",6.0,5.9,4,True
4,Honda,Blue,28561.250,4,"$7,500.00",6.0,9.7,4,True
5,Toyota,White,37500.000,4,"$6,250.00",6.0,7.8,4,True
6,Toyota,Green,62008.125,4,"$4,500.00",6.0,5.6,4,True
7,BMW,Black,6986.875,5,"$22,000.00",5.0,9.6,4,True
8,Honda,Red,54936.875,4,"$5,000.00",5.0,9.2,4,True
9,Nissan,White,19750.000,4,"$9,700.00",6.0,10.0,4,True